server/stress_get.yml
config:
  target: 'http://localhost:3003'
  processor: './stressor.js'
  ensure:
    maxErrorRate: 2
  phases:
    - duration: 10
      arrivalRate: 1
      maxVusers: 1
      name: "Warm up"
    - duration: 20
      arrivalRate: 1
      rampTo: 10
      maxVusers: 10
      name: "x10"
    - duration: 30
      arrivalRate: 10
      rampTo: 100
      maxVusers: 100
      name: "x100"
    - duration: 60
      arrivalRate: 100
      rampTo: 1000
      maxVusers: 1000
      name: "Sustained max load"
  # defaults:
  #   headers:
  #     x-my-service-auth: '987401838271002188298567'
scenarios:
  - name: "GET related items"
    flow:
    - function: "generateId"
    - get:
        url: "/?={id}"
    - log: "GET request with ID: {{id}}"