server/stress_post.yml
config:
  target: 'http://localhost:3003'
  processor: './stressor.js'
  http:
    pool: 50
  ensure:
    maxErrorRate: 2
  phases:
    - duration: 10
      arrivalRate: 1
      maxVusers: 1
      name: "Warm up"
    - duration: 20
      arrivalRate: 1
      rampTo: 10
      maxVusers: 10
      name: "x10"
    - duration: 30
      arrivalRate: 10
      rampTo: 100
      maxVusers: 100
      name: "x100"
    - duration: 60
      arrivalRate: 100
      rampTo: 1000
      maxVusers: 1000
      name: "Sustained max load"
scenarios:
  - name: "POST items"
    flow:
    - function: "generatePost"
    - post:
        url: "/api/addProduct/"
        json:
          productId: "{{ productId }}"
          name: "{{ name }}"
          price: "{{ price }}"
          prime: "{{ prime }}"
          imageUrl: "{{ imageUrl }}"
          numReviews: "{{ numReviews }}"
          avgRating: "{{ avgRating }}"
          category: "{{ category }}"
      count: 10
    # - log: "POST request with ID: {{productId}}"